0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 3e+6;

boundaryField
{
    inlet
    {
	type            totalPressure;
	value           $internalField;
	p0              $internalField;
	psi				thermo:psi;
	gamma           1.4;
	
//	type		fixedValue;
//	value		uniform 20500;
    }
    
    #include "emptySymmetry.include"

    horiz-outlet
    {
        type            totalPressure;
        value           uniform 1e+5;
        p0              uniform 1e+5;
		U				U;
		phi				phi;
		rho				rho;
    }
	vert-outlet
    {
        type            totalPressure;
        value           uniform 1e+5;
        p0              uniform 1e+5;
        psi		        thermo:psi;
        gamma           1.4;
    }
    left-walls
    {
        type           zeroGradient;
    }
    nozzle-walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //



