0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 294.44;

boundaryField
{
    inlet
    {
        type            totalTemperature;
        value           uniform 294.44;
        T0              uniform 294.44;
        U               U;
        phi             phi;
        psi		thermo:psi;
        gamma           1.4;
    }
    
    #include "emptySymmetry.include"
    #include "zeroGradient.include"
}


// ************************************************************************* //
