0/emptySymmetry.include
    symmetry-plane
    {
	type		symmetryPlane;
    }
    defaultFaces
    {
        type            empty;
    }



