0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 63.57;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity	0.01;
        value           uniform 63.57;
    }
    
    #include "emptySymmetry.include"
    
    vert-outlet
    {
        type            zeroGradient;
    }
    
    horiz-outlet
    {
        type            zeroGradient;
    }
    
    left-walls
    {
        type           kqRWallFunction;
        value		uniform 63.57;
    }
    
    nozzle-walls
    {
        type           kqRWallFunction;
        value		uniform 64.57;
    }
}


// ************************************************************************* //



