0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 5000;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength	0.0005;
        value           uniform 5000;
    }
    
    #include "emptySymmetry.include"
    
    vert-outlet
    {
        type            zeroGradient;
    }
    
    horiz-outlet
    {
        type            zeroGradient;
    }
    
    left-walls
    {
	type            omegaWallFunction;
	value           uniform 5000;
	Cmu             0.09;
	kappa           0.41;
	E               9.8;
    }
    
    nozzle-walls
    {
	type            omegaWallFunction;
	value           uniform 5000;
	Cmu             0.09;
	kappa           0.41;
	E               9.8;
    }
}


// ************************************************************************* //



