0/zeroGradient.include

    vert-outlet
    {
        type            zeroGradient;
    }
    horiz-outlet
    {
        type            zeroGradient;
    }
    left-walls
    {
        type           zeroGradient;
    }
    nozzle-walls
    {
        type            zeroGradient;
    }

