system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  2.1.1                                 |
  |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
		version     2.0;
		format      ascii;
		class       dictionary;
		location    "system";
		object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
		"(rho|rhoU|rhoE)"
		{
				solver          diagonal;
		}

		U
		{
				solver          smoothSolver;
				smoother        GaussSeidel;
				nSweeps         2;
				tolerance       1e-10;
				relTol          0;
		}

		h
		{
				$U;
				tolerance       1e-10;
				relTol          0;
		}
		omega
		{
				$U;
				tolerance	1e-10;
				relTol		0;
		}

		k
		{
				$U
						tolerance	1e-10;
				relTol		0;
		}
}


// ************************************************************************* //
